<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Installs the current release version of Slack.</string>
    <key>Identifier</key>
    <string>com.whistic.install.slack</string>
    <key>Input</key>
    <dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.whistic.pkg.slack</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>Installer</string>
      </dict>
    </array>
  </dict>
</plist>