<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Avira Free Mac Security.</string>
	<key>Identifier</key>
	<string>com.whistic.download.AviraFreeMacSecurity</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Avira Free Mac Security</string>
		<key>DISABLE_CODE_SIGNATURE_VERIFICATION</key>
    <string>true</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>AviraFreeMacSecurity.pkg</string>
				<key>url</key>
				<string>https://www.avira.com/downloads/frontendDl/defaultDownload?product=avira-free-antivirus-for-mac</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<!-- <dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Application: Avira Operations GmbH &amp; Co. KG (8DP7YP837J)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict> -->
	</array>
</dict>
</plist>
