<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Avira Free Mac Security and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.whistic.munki.AviraFreeMacSecurity</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Avira Free Mac Security</string>
		<key>pkginfo</key>
		<dict>
			<!-- <key>RestartAction</key> -->
			<!-- <string>RequireLogout</string> -->
			<key>blocking_applications</key>
			<array>
				<string>Avira.app</string>
				<string>Avira-Supportcollector.app</string>
				<string>Avira-Uninstall.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Utilities</string>
			<key>description</key>
			<string>Lightweight and well reviewed antivirus and antimalware software for Mac.</string>
			<key>developer</key>
			<string>Avira Operations GmbH &amp; Co. KG</string>
			<key>display_name</key>
			<string>Avira Free Mac Security</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>installcheck_script</key>
			<string>#!/bin/sh
[ -d "/Applications/Avira.app" ] &amp;&amp; exit 1 || exit 0
			</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>ParentRecipe</key>
	<string>com.whistic.pkg.AviraFreeMacSecurity</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
