<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest release of Signal Desktop and imports it into Munki.</string>
		<key>Identifier</key>
		<string>com.whistic.munki.SignalDesktop</string>
		<key>Input</key>
		<dict>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps/%NAME%</string>
			<key>NAME</key>
			<string>SignalDesktop</string>
			<key>MUNKI_CATEGORY</key>
			<string>Communication</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>description</key>
				<string>Signal Messenger is a messaging app that allows users to communicate with anonymity in the sense that the source of each message cannot be detected by outside parties.</string>
				<key>developer</key>
				<string>Signal Messenger LLC.</string>
				<key>display_name</key>
				<string>Signal Desktop</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>category</key>
				<string>Communication</string>
				<key>unattended_install</key>
				<true/>
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>0.6.1</string>
		<key>ParentRecipe</key>
		<string>com.whistic.download.SignalDesktop</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>dmg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
					<key>dmg_root</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/Applications</string>
				</dict>
				<key>Processor</key>
				<string>DmgCreator</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
					<key>pkg_path</key>
					<string>%dmg_path%</string>
				</dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
			</dict>
		</array>
	</dict>
</plist>